lib/tasks/dev.rake

  task add_coins: :environment do
    show_spinner("Cadastrando moedas...") do
      coins = [
                  {
                      description: "Bitcoin",
                      acronym: "BTC",
                      url_image: "https://s2.coinmarketcap.com/static/img/coins/200x200/1.png",
                      mining_type: MiningType.find_by(acronym: 'PoW')
                  },
                  {
                      description: "Ethereum",
                      acronym: "ETH",
                      url_image: "https://s2.coinmarketcap.com/static/img/coins/200x200/1027.png",
                      mining_type: MiningType.find_by(acronym: 'PoW')
                  },
                  {
                      description: "BNB",
                      acronym: "BNB",
                      url_image: "https://s2.coinmarketcap.com/static/img/coins/200x200/1839.png",
                      mining_type: MiningType.find_by(acronym: '#')
                  },
                  {
                      description: "TRON",
                      acronym: "TRX",
                      url_image: "https://s2.coinmarketcap.com/static/img/coins/200x200/1958.png",
                      mining_type: MiningType.find_by(acronym: '#')
                  }
              ]

      coins.each do |coin|
          Coin.find_or_create_by!(coin)
---
SELECT  "mining_types".* FROM "mining_types" WHERE "mining_types"."acronym" = ? LIMIT ?  [["acronym", "PoW"], ["LIMIT", 1]]
SELECT  "coins".* FROM "coins" WHERE "coins"."description" = ? AND "coins"."acronym" = ? AND "coins"."url_image" = ? LIMIT ?  [["description", "Bitcoin"], ["acronym", "BTC"], ["url_image", "https://s2.coinmarketcap.com/static/img/coins/200x200/1.png"], ["LIMIT", 1]]
SELECT  "mining_types".* FROM "mining_types" WHERE "mining_types"."acronym" = ? LIMIT ?  [["acronym", "#"], ["LIMIT", 1]]
INSERT INTO "coins" ("description", "acronym", "url_image", "created_at", "updated_at", "mining_type_id") VALUES (?, ?, ?, ?, ?, ?)

  task add_mining_types: :environment do
    show_spinner("Cadastrando tipos de mineração...") do
      mining_types = [
        {
            description: "Proof of Work",
            acronym: "PoW"
        },
        {
            description: "Proof of Stake",
            acronym: "PoS"
        },
        {
            description: "Not Mineable",
            acronym: "#"
        }
      ]

      mining_types.each do |mining_type|
          MiningType.find_or_create_by!(mining_type)
---
INSERT INTO "mining_types" ("description", "acronym", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "Proof of Work"], ["acronym", "PoW"], ["created_at", "2023-06-01 21:45:41.083146"], ["updated_at", "2023-06-01 21:45:41.083146"]]