app/controllers/coins_controller.rb

  def create
    @coin = Coin.new(coin_params)

    respond_to do |format|
      if @coin.save
---
INSERT INTO "coins" ("description", "acronym", "url_image", "created_at", "updated_at", "mining_type_id") VALUES (?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @coin.update(coin_params)
---
UPDATE "coins" SET "acronym" = ?, "updated_at" = ? WHERE "coins"."id" = ?  [["acronym", "BTC1"], ["updated_at", "2023-06-14 22:40:20.504765"], ["id", 1]]